0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    y0
    {
        type            calculated;
        value           uniform 0;
    }

    y1
    {
        type            calculated;
        value           uniform 0;
    }

    terrain
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    x0
    {
        type            symmetry;
    }

    x1
    {
        type            symmetry;
    }

    sky
    {
        type            symmetry;
    }

        Buildings
    {
        type            nutkWallFunction;
	value		uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
