0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    y0
    {
        type            zeroGradient;
    }

    y1
    {
        type            totalPressure;
        p0              uniform 0;
        gamma           1.4;
        value           uniform 0;
    }

    terrain
    {
        type            zeroGradient;
    }

    x0
    {
        type            symmetry;
    }

    x1
    {
        type            symmetry;
    }

    sky
    {
        type            symmetry;
    }

    Buildings
    {
        type            zeroGradient;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
